Bwooce/ardupilot/libraries/AP_HAL_ESP32/targets/esp32s3/esp-idf/sdkconfig.defaults
# ESP32-S3 sdkconfig defaults for ArduPilot
# Compatible with ESP-IDF 5.5+ and 6.0+
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_BOOTLOADER_WDT_ENABLE=n
CONFIG_APP_COMPILE_TIME_DATE=n
CONFIG_APP_EXCLUDE_PROJECT_VER_VAR=y
CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR=y
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_4=n
CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES_TWO=y
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=n
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=n
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# WDT configuration is set per-board by the hwdef generator (debug vs production).
# Do NOT set CONFIG_ESP_TASK_WDT_INIT here -- it would conflict with board config.
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_IPC_TASK_STACK_SIZE=1536
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=10
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_ISR_STACKSIZE=2100
CONFIG_FREERTOS_CORETIMER_SYSTIMER_LVL3=y
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_LWIP_MAX_SOCKETS=5
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y
# Production crash/corruption detection (minimal overhead)
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_HEAP_POISONING_LIGHT=y
CONFIG_ESP_SYSTEM_HW_STACK_GUARD=y
# Frame pointer enables runtime backtraces without debug symbols (~5% binary, ~1% perf)
CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y
# Per-task heap tracking for memory debugging (which task uses how much heap)
CONFIG_HEAP_TASK_TRACKING=y
# Core dump to flash -- on panic, writes ELF core dump to coredump partition
# Retrieve with: idf.py coredump-info -p /dev/ttyUSBx
# Debug with: idf.py coredump-debug -p /dev/ttyUSBx (launches GDB)
# IDF 6.0 auto-selects ELF format; IDF 5.x needs explicit CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
# but silently ignores unknown options, so omitting it works for both.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# SPI flash auto-suspend allows ISRs to run from flash during flash writes,
# reducing the amount of code that MUST be in IRAM. Requires compatible flash chip.
# Enable after verifying the board's flash supports auto-suspend.
# CONFIG_SPI_FLASH_AUTO_SUSPEND=y
# PSRAM Configuration for ESP32-S3
# Mode (QUAD vs OCT) is set per-board in sdkconfig.board by the hwdef generator.
# Do NOT set CONFIG_SPIRAM_MODE_* here -- it would override board-specific config.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
# Configure ESP-IDF to use USB-Serial/JTAG as primary console
# This prevents UART0 buffer overflow when no external UART is connected
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
